数据分析Toturial

书上内容总结：
1. 数据挖掘基础
    1. 某知名连锁餐饮企业的困惑
        * 大量历史数据
        * 洞察商机，提取价值
        * 同质化的市场竞争，寻找差异化
    2. 从餐饮服务到数据挖掘
        * 过去获取产品和客户的特点以及能够产生价值的规律依赖于管理人员的个人经验
        * 从业务数据中发掘知识和解决方案，提高决策水平和竞争能力
        * 挖掘隐含的、未知的、对决策有潜在价值的关系、模式和趋势，建立支持模型，提供预测性决策支持的方法、工具和过程，就是数据挖掘
    3. 数据挖掘基本任务
        * 利用分类与预测、聚类分析、关联规则、时序模式、偏差检测、智能推荐等方法，帮助企业提取数据中蕴含的商业价值
    4. 数据挖掘建模过程
        1. 定义挖掘目标
        2. 数据取样
        3. 数据探索
        4. 数据预处理
        5. 挖掘建模
        6. 模型评价
    5. 常用的数据挖掘建模工具
SAS Enterprise Miner、IBM SPSS Modeler、SQL Server、Python、WEKA、KNIME、RapidMiner、TipDM
3. 数据探索
    1. 数据质量分析
通过pandas的describe()函数可以看到数据的一些统计信息
        * 缺失值
        * 异常值
        * 不一致值
        * 重复数据、含有特殊符号的数据
        1. 缺失值分析
            1. 原因：无法获取、代价太大、遗漏
            2. 影响：丢失有用信息、建模不稳定、输出不可靠
            3. 分析：缺失数和缺失率
            4. 处理：删除，插补，不处理
        2. 异常值分析（离群值分析）
            1. 简单统计量分析 最大值、最小值等
            2. 3σ原则
如果数据服从正态分布，如果值偏离平均值3倍标准差，则视为异常值，P<0.003
            3. 箱型图
异常值定义为下四分位向下1.5倍上下四分位差IQR，和上四分位向上1.5倍IQR之外的数据，因为上下四分位之间包含了一般观察值的数据。
        3. 一致性分析
容易发生在数据同步过程中， 更新数据只更新了部分数据导致的矛盾
    2. 数据特征分析
        1. 分布分析
            1. 定量
                1. 极差、组距、组数、分点、分布直方图
            2. 定性
        2. 对比分析
        3. 统计量分析
            1. 集中趋势
                1. 均值
                2. 中位数
                3. 众数
            2. 离中趋势分析
                1. 极差
                2. 标准差
                3. 变异系数
        4. 周期性分析
        5. 贡献度分析 2-8法则
        6. 相关性分析
            1. 散点图
            2. 散点矩阵
            3. 相关系数
                1. pearson系数 两个连续、正态分布
                2. Spearman系数 非正态、分类、等级
                3. 判定系数
相关系数的平方r方，衡量回归方程的解释成r2 ~ (0,1)
Python:
data.corr()
data.corr()[u’’]
data[u’’].corr(data[u’'])
    3. Python主要数据探索函数
        1. 基本统计特征函数
sum() mean() var() std() corr() cov() skew() kurt() describe()
DataFrame.sum() ...
        2. 拓展统计特征函数
        3. 统计作图函数



课堂补充总结：
•	数据分析分类
1.	描述性数据分析：现状是什么。例：数据仓库、报表、数据可视化
2.	预测性数据分析：未来会发生什么。
3.	prescription分析：应该怎么做。

•	拿到数据之后：首先要了解业务背景，痛点是什么

•	数据挖掘解决6类问题：
1.	异常检测
2.	关联分析（提前发现关联规则，对关联规则的挖掘）
3.	摘要（data summarisation ）: 将重要的信息提炼出来；例：主成分分析
4.	分类
5.	回归
6.	聚类

•	数据挖掘 VS 数据分析 VS 数据探索 区分：
数据挖掘是手段；
数据分析的最终目的是分析一个问题；
数据探索：
1.	数据分析的一个阶段 （当回答一个确定性问题的时候，数据探索是数据分析的一个阶段）
2.	一种工具，通过异常检测的手段来找到出现问题的地方，出现了什么问题

•	有时候需要将数据聚合后才能做异常值检测（如将表聚合后才能发现数据重复）

•	发现异常后，需要跟业务人员进行核实确认，而不是直接丢掉。（需要解释为什么会有这些异常值，原因）

•	定性、定量分析
定性：分类、种类的分布分析（没有明确的划分标准，自己去划分），无法量化的字段；
定量：一般是数值，可以量化的字段

•	周期性的分析一定是跟时间相关的

•	pearson与spearman
pearson： 对连续的变量求相关性
spearman：对离散的变量求相关性

•	重点关注：相关性分析、异常检测

